org/pomodorocoder.org
#+TITLE: Pomodoro Coder

#+HUGO_BASE_DIR: ./temp/
#+HUGO_SECTION: ./
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

***** setState Gotcha!
:PROPERTIES:
:EXPORT_FILE_NAME: setstate-gocha
:EXPORT_DATE: <2017-11-13 Mon>
:END:
****** Objectives
       - Use a function as the first parameter to setState
       - Add a callback to setState to determine when the state is up to date
****** setState that depends on previous state
#+begin_src js
this.state = {counter: 1};

// New value of the counter depends on the old value
this.setState({
    counter: this.state.counter + 1
})

// If we do this again and for multiple times
this.setState({
    counter: this.state.counter + 1
})
#+end_src

We expect the result to be 3, however it's actually 2. The reason is setState is Asychronous. It's eventually doing this:

#+begin_src js
this.setState({
    counter: this.state.counter + 1
});

Object.assign(
    {},
    {counter: this.state.counter + 1}, // this.state.counter will always be 1
    {counter: this.state.counter + 1},
    {counter: this.state.counter + 1}
);
#+end_src

The solution is to update function
#+begin_src js
this.setState((prevState, props) => {
    return {
        counter: prevState.counter + 1
    };
});
#+end_src

The rule is whenever a setState depends on previous state, use a function parameter.
****** setState is Asynchronous
Sometimes, I use console.log for debugging, however the method below won't work because setState is asynchronous
#+begin_src js
this.setState({name: "Tim"}); 
console.log(this.state.name); // Won't be updated yet
#+end_src

The correct way should use a callback function
#+begin_src js
this.setState({name: "Tim"}, () => {
    console.log(
        "Now state is up to date",
        this.state.name
    );
});
#+end_src

